NordicPlayground/nrf52-quadcopter/Firmware/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
/*static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_ENABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud38400
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
} */
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    //advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling radio events and switching advertisement data **/

uint8_t advertising_switch_counter = 0;
static void read_from_block(void);

void radio_notification_evt_handler(void* p_context){
	    if(advertising_switch_counter % 2 == 0)
        {
            // Switching to Eddystone
            advertising_init_eddystone();
        }
        else
        {
            // Advertises that the device is connectable
            advertising_init();
        }
        advertising_switch_counter++;

			if(advertising_switch_counter % 20 == 0 && user_connected == false){
					led_advertising();
				  controllerResetAllPID();
			}

			if(advertising_switch_counter % 85 == 0 && user_connected == true){
				current_battery_level = max17043_get_soc();

				if (battery_level != current_battery_level){
					battery_level = current_battery_level;
					send_battery_level(battery_level);
				}
			}
			if(advertising_switch_counter % 15 == 0 && !nrf_gpio_pin_read(PM_PGOOD))
				led_blink();
			else if(nrf_gpio_pin_read(PM_PGOOD))
				led_blink_clear();
}

void advertising_timer_init(void){

  app_timer_create(&advertising_timer, APP_TIMER_MODE_REPEATED, &radio_notification_evt_handler);
  //Starts the timer, sets it up for repeated start.
  app_timer_start(advertising_timer, APP_TIMER_TICKS(300, 15), NULL);
}

static void on_radio_notif(bool radio_active){

}

/** @brief Function for handling pstorage events
 */
static void pstorage_ntf_cb(pstorage_handle_t *  p_handle,
                            uint8_t              op_code,
                            uint32_t             result,
                            uint8_t *            p_data,
                            uint32_t             data_len)
{
    APP_ERROR_CHECK(result);
}


/** @brief Function for initializing pstorage
 */
static void flash_access_init(void)
{
    uint32_t err_code;
    
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);    	
	
    pstorage_module_param_t pstorage_param;
    
	  pstorage_param.cb = pstorage_ntf_cb;
    pstorage_param.block_size = 20;
    pstorage_param.block_count = 1;
    
    err_code = pstorage_register(&pstorage_param, &m_pstorage_base_id);
    APP_ERROR_CHECK(err_code);
	
	  err_code = pstorage_block_identifier_get(&m_pstorage_base_id, 0, &m_pstorage_block_id);
	  APP_ERROR_CHECK(err_code);
}

static void write_default_values()
{
	uint32_t err_code;
	
	static uint8_t read_data[20];
	memcpy(read_data, get_default(), 20);
	
	SEGGER_RTT_printf(0,"Default values!: %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d \n", read_data[0], read_data[1], read_data[2], read_data[3], read_data[4], read_data[5], read_data[6], read_data[7], read_data[8], read_data[9], read_data[10], read_data[11], read_data[12], read_data[13], read_data[14], read_data[15], read_data[16], read_data[17], read_data[18], read_data[19]);
	
	static uint32_t default_data[20/sizeof(uint32_t)];
	uint8_t * p_def_dat = (uint8_t *) default_data;
	memcpy(default_data, read_data, 20);
	
	set_reg_param(p_def_dat);
	
  err_code = pstorage_clear(&m_pstorage_block_id, 20);
	APP_ERROR_CHECK(err_code);
	
	err_code = pstorage_store(&m_pstorage_block_id, p_def_dat, 20, 0);
	APP_ERROR_CHECK(err_code);
}

static void write_to_block(uint8_t *read_data){
	
	uint32_t err_code;
	
  err_code = pstorage_clear(&m_pstorage_block_id, 20);
	APP_ERROR_CHECK(err_code);
	
	err_code = pstorage_store(&m_pstorage_block_id, read_data, 20, 0);
	APP_ERROR_CHECK(err_code);
	
	SEGGER_RTT_printf(0,"Block written!: %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d \n", read_data[0], read_data[1], read_data[2], read_data[3], read_data[4], read_data[5], read_data[6], read_data[7], read_data[8], read_data[9], read_data[10], read_data[11], read_data[12], read_data[13], read_data[14], read_data[15], read_data[16], read_data[17], read_data[18], read_data[19]);
}

static void read_from_block(void){
	
