NordicPlayground/nrf52-quadcopter/Firmware/main.c
	uint8_t read_data[20] = {0};
	
	pstorage_load(read_data, &m_pstorage_block_id, 20, 0);
	
	SEGGER_RTT_printf(0,"Block read!: %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d - %d \n", read_data[0], read_data[1], read_data[2], read_data[3], read_data[4], read_data[5], read_data[6], read_data[7], read_data[8], read_data[9], read_data[10], read_data[11], read_data[12], read_data[13], read_data[14], read_data[15], read_data[16], read_data[17], read_data[18], read_data[19]);
	
	if(read_data[19] != MAGIC_FLASH_BYTE)
		write_default_values();
	else
		set_reg_param(read_data);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

    // Initialize.

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    //uart_init();

		//Initalize peripheral functions

	  i2cdev_initialize(); /** Starts twi-driver. **/
    i2cdev_enable(true);
	  imu_init(); // Initalizes not only the imu, but every slave that contributes to stabilization on the TWI-channel.
	  pm_config(); // Sets up the charger and the fuel gauge.
    cmd_init();
	  motor_init(); //Sets up PWM for motors.
	
		led_config(); // Sets up LEDs on the quadcopter.

    // Initialize bluetooth functions

	  ble_stack_init(); //Initializes the softdevice.
		
		flash_access_init(); //Grants access to flash and the data that has been put into the pstorage block. Must be initialized befor the softdevice.
		read_from_block(); //First read from the block. Puts the read values into the RX-characteristic to be read from software.
		battery_level = max17043_get_soc(); // Reads battery level to be put into the RX-characteristic.
		
    gap_params_init();
    services_init();
    advertising_init();
	  conn_params_init();

		//Start advertising
    err_code = ble_radio_notification_init (_PRIO_APP_HIGH, NRF_RADIO_NOTIFICATION_DISTANCE_800US,on_radio_notif);
    APP_ERROR_CHECK(err_code);
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

		advertising_timer_init(); //Starts advertising timer. Switches between standard GAP-packages and eddystone-URL frames.
		
    stab_init(); //Initalizes controllers. This has to be put after the bluetooth functions have been initalized, or else the quick controller timer will conflict with the advertising timer.
    sensfusion6Init(); //Initializes the Madqwick-filter, which interpretes the raw data from the IMU.
		read_from_block(); //Reads from block yet again, to put the data read into the controllers.
		

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}


/**
 * @}
 */
